In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.DataFrame() # pulls data from RAM memory. Make sure only the data under current usage is accessed via dataframes.

In [3]:
print (df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1= pd.DataFrame([[1,2,3,4,],[5,6,7,8,],[2,7,3,23],[3,6,8,23],[28,23,63,12]] )
# df1= pd.DataFrame([[1,2,3,4,],[5,6,7,8,],[2,7,3,23],[3,6,8,23],[28,23,63,12]],columns= ['A','B','C','D'] ) # another method to rename columns

In [5]:
df1.columns= ['A','B','C','D']

In [6]:
df1.row= ['A','B','C','D'] # this wont work. search online.

C:\Users\DELL\AppData\Local\Temp\ipykernel_1188\1675355827.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df1.row= ['A','B','C','D'] # this wont work. search online.

In [7]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  28  23  63  12

In [8]:
df1.head(3) # displays the top3 rows

   A  B  C   D
0  1  2  3   4
1  5  6  7   8
2  2  7  3  23

In [9]:
df1.tail(3) #displays bottom3 rows

    A   B   C   D
2   2   7   3  23
3   3   6   8  23
4  28  23  63  12

In [10]:
df1.tail(2)

    A   B   C   D
3   3   6   8  23
4  28  23  63  12

In [11]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  28  23  63  12

In [12]:
df1.shape

(5, 4)

In [13]:
df1.iloc[0,1]

2

In [14]:
 df1.iloc[4,3] # row,column

12

In [15]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  28  23  63  12

In [16]:
df1.iloc[2:5,1:4] #[from row : to row-1, from coloumn : to column -1]

    B   C   D
2   7   3  23
3   6   8  23
4  23  63  12

In [17]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  6  7